# FabricWireDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricWireDiameter Property
ParameterTypeId Class See Also
---
"Nominal Diameter": Nominal Diameter of Fabric Wire.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricWireDiameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricWireDiameter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricWireDiameter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace